{
  "model_type": "quasar",
  "architectures": [
    "Quasar"
  ],
  "hidden_size": 8192,
  "num_hidden_layers": 96,
  "num_attention_heads": 64,
  "num_key_value_heads": 64,
  "num_experts": 128,
  "num_experts_per_tok": 32,
  "expert_dim": 2048,
  "hidden_act": "gelu",
  "vocab_size": 151552,
  "tie_word_embeddings": false,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "torch_dtype": "bfloat16"
}